---
kind: property
id: P:Autodesk.Revit.DB.SchedulableField.FieldType
source: html/8ea6756f-aa39-2a10-792a-c22eae32db55.htm
---
# Autodesk.Revit.DB.SchedulableField.FieldType Property

The type of data displayed by the field.

## Syntax (C#)
```csharp
public ScheduleFieldType FieldType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: fieldType is not a schedulable field type
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration